packages/react-flight-router-e2e/artillery/mixed-load.yml
config:
  target: "http://localhost:{{ $processEnvironment.PORT }}"
  phases:
    - duration: 30
      arrivalRate: 15
      name: "Mixed page + action load"

scenarios:
  - name: "Page navigation"
    weight: 60
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/__rsc?url=/request-info"
  - name: "Action submission"
    weight: 40
    flow:
      - post:
          url: "/__action"
          headers:
            X-RSC-Action: "app/routes/slow-action#slowAction"
            Content-Type: "text/plain"
          body: '[null, {"delay": 100}]'